DISTORTEC/distortos/source/chip/STM32/STM32F4/include/distortos/chip/STM32F4-RCC-bits.h
/*---------------------------------------------------------------------------------------------------------------------+
| RCC_AHB3RSTR - RCC AHB3 peripheral reset register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_AHB3RSTR_QSPIRST_bit			1
#define RCC_AHB3RSTR_FMCRST_bit				0
#define RCC_AHB3RSTR_FSMCRST_bit			0

#define RCC_AHB3RSTR_QSPIRST_bb				BITBAND(&RCC->AHB3RSTR, RCC_AHB3RSTR_QSPIRST_bit)
#define RCC_AHB3RSTR_FMCRST_bb				BITBAND(&RCC->AHB3RSTR, RCC_AHB3RSTR_FMCRST_bit)
#define RCC_AHB3RSTR_FSMCRST_bb				BITBAND(&RCC->AHB3RSTR, RCC_AHB3RSTR_FSMCRST_bit)

/*---------------------------------------------------------------------------------------------------------------------+
| RCC_APB1RSTR - APB1 peripheral reset register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_APB1RSTR_UART8RST_bit			31
#define RCC_APB1RSTR_UART7RST_bit			30

#define RCC_APB1RSTR_DACRST_bit				29
#define RCC_APB1RSTR_PWRRST_bit				28
#define RCC_APB1RSTR_CECRST_bit				27

#define RCC_APB1RSTR_CAN3RST_bit			27
#define RCC_APB1RSTR_CAN2RST_bit			26
#define RCC_APB1RSTR_CAN1RST_bit			25

#define RCC_APB1RSTR_FMPI2C1RST_bit			24
#define RCC_APB1RSTR_I2C3RST_bit			23
#define RCC_APB1RSTR_I2C2RST_bit			22
#define RCC_APB1RSTR_I2C1RST_bit			21

#define RCC_APB1RSTR_UART5RST_bit			20
#define RCC_APB1RSTR_UART4RST_bit			19
#define RCC_APB1RSTR_USART3RST_bit			18
#define RCC_APB1RSTR_USART2RST_bit			17

#define RCC_APB1RSTR_SPDIFRXRST_bit			16

#define RCC_APB1RSTR_SPI3RST_bit			15
#define RCC_APB1RSTR_SPI2RST_bit			14

#define RCC_APB1RSTR_WWDGRST_bit			11

#define RCC_APB1RSTR_LPTIM1RST_bit			9
#define RCC_APB1RSTR_TIM14RST_bit			8
#define RCC_APB1RSTR_TIM13RST_bit			7
#define RCC_APB1RSTR_TIM12RST_bit			6
#define RCC_APB1RSTR_TIM7RST_bit			5
#define RCC_APB1RSTR_TIM6RST_bit			4
#define RCC_APB1RSTR_TIM5RST_bit			3
#define RCC_APB1RSTR_TIM4RST_bit			2
#define RCC_APB1RSTR_TIM3RST_bit			1
#define RCC_APB1RSTR_TIM2RST_bit			0

#define RCC_APB1RSTR_UART8RST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_UART8RST_bit)
#define RCC_APB1RSTR_UART7RST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_UART7RST_bit)

#define RCC_APB1RSTR_DACRST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_DACRST_bit)
#define RCC_APB1RSTR_PWRRST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_PWRRST_bit)
#define RCC_APB1RSTR_CECRST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_CECRST_bit)

#define RCC_APB1RSTR_CAN3RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_CAN3RST_bit)
#define RCC_APB1RSTR_CAN2RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_CAN2RST_bit)
#define RCC_APB1RSTR_CAN1RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_CAN1RST_bit)

#define RCC_APB1RSTR_FMPI2C1RST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_FMPI2C1RST_bit)
#define RCC_APB1RSTR_I2C3RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_I2C3RST_bit)
#define RCC_APB1RSTR_I2C2RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_I2C2RST_bit)
#define RCC_APB1RSTR_I2C1RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_I2C1RST_bit)

#define RCC_APB1RSTR_UART5RST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_UART5RST_bit)
#define RCC_APB1RSTR_UART4RST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_UART4RST_bit)
#define RCC_APB1RSTR_USART3RST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_USART3RST_bit)
#define RCC_APB1RSTR_USART2RST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_USART2RST_bit)

#define RCC_APB1RSTR_SPDIFRXRST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_SPDIFRXRST_bit)

#define RCC_APB1RSTR_SPI3RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_SPI3RST_bit)
#define RCC_APB1RSTR_SPI2RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_SPI2RST_bit)

#define RCC_APB1RSTR_WWDGRST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_WWDGRST_bit)

#define RCC_APB1RSTR_LPTIM1RST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_LPTIM1RST_bit)
#define RCC_APB1RSTR_TIM14RST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_TIM14RST_bit)
#define RCC_APB1RSTR_TIM13RST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_TIM13RST_bit)
#define RCC_APB1RSTR_TIM12RST_bb			BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_TIM12RST_bit)
#define RCC_APB1RSTR_TIM7RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_TIM7RST_bit)
#define RCC_APB1RSTR_TIM6RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_TIM6RST_bit)
#define RCC_APB1RSTR_TIM5RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_TIM5RST_bit)
#define RCC_APB1RSTR_TIM4RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_TIM4RST_bit)
#define RCC_APB1RSTR_TIM3RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_TIM3RST_bit)
#define RCC_APB1RSTR_TIM2RST_bb				BITBAND(&RCC->APB1RSTR, RCC_APB1RSTR_TIM2RST_bit)

/*---------------------------------------------------------------------------------------------------------------------+
| RCC_APB2RSTR - APB2 peripheral reset register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_APB2RSTR_DSIRST_bit				27
#define RCC_APB2RSTR_LTDCRST_bit			26

#define RCC_APB2RSTR_DFSDM2RST_bit			25
#define RCC_APB2RSTR_DFSDM1RST_bit			24

#define RCC_APB2RSTR_SAI2RST_bit			23
#define RCC_APB2RSTR_SAI1RST_bit			22

#define RCC_APB2RSTR_SPI6RST_bit			21
#define RCC_APB2RSTR_SPI5RST_bit			20

#define RCC_APB2RSTR_TIM11RST_bit			18
#define RCC_APB2RSTR_TIM10RST_bit			17
#define RCC_APB2RSTR_TIM9RST_bit			16

#define RCC_APB2RSTR_SYSCFGRST_bit			14

#define RCC_APB2RSTR_SPI4RST_bit			13
#define RCC_APB2RSTR_SPI1RST_bit			12

#define RCC_APB2RSTR_SDIORST_bit			11

#define RCC_APB2RSTR_ADC1RST_bit			8
#define RCC_APB2RSTR_ADCRST_bit				8

#define RCC_APB2RSTR_UART10RST_bit			7
#define RCC_APB2RSTR_UART9RST_bit			6
#define RCC_APB2RSTR_USART6RST_bit			5
#define RCC_APB2RSTR_USART1RST_bit			4

#define RCC_APB2RSTR_TIM8RST_bit			1
#define RCC_APB2RSTR_TIM1RST_bit			0

#define RCC_APB2RSTR_DSIRST_bb				BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_DSIRST_bit)
#define RCC_APB2RSTR_LTDCRST_bb				BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_LTDCRST_bit)

#define RCC_APB2RSTR_DFSDM2RST_bb			BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_DFSDM2RST_bit)
#define RCC_APB2RSTR_DFSDM1RST_bb			BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_DFSDM1RST_bit)

#define RCC_APB2RSTR_SAI2RST_bb				BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_SAI2RST_bit)
#define RCC_APB2RSTR_SAI1RST_bb				BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_SAI1RST_bit)

#define RCC_APB2RSTR_SPI6RST_bb				BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_SPI6RST_bit)
#define RCC_APB2RSTR_SPI5RST_bb				BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_SPI5RST_bit)

#define RCC_APB2RSTR_TIM11RST_bb			BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_TIM11RST_bit)
#define RCC_APB2RSTR_TIM10RST_bb			BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_TIM10RST_bit)
#define RCC_APB2RSTR_TIM9RST_bb				BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_TIM9RST_bit)

#define RCC_APB2RSTR_SYSCFGRST_bb			BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_SYSCFGRST_bit)

#define RCC_APB2RSTR_SPI4RST_bb				BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_SPI4RST_bit)
#define RCC_APB2RSTR_SPI1RST_bb				BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_SPI1RST_bit)

#define RCC_APB2RSTR_SDIORST_bb				BITBAND(&RCC->APB2RSTR, RCC_APB2RSTR_SDIORST_bit)

