DISTORTEC/distortos/source/chip/STM32/STM32F4/include/distortos/chip/STM32F4-RCC-bits.h
#define RCC_APB1ENR_LPTIM1EN_bit			9
#define RCC_APB1ENR_TIM14EN_bit				8
#define RCC_APB1ENR_TIM13EN_bit				7
#define RCC_APB1ENR_TIM12EN_bit				6
#define RCC_APB1ENR_TIM7EN_bit				5
#define RCC_APB1ENR_TIM6EN_bit				4
#define RCC_APB1ENR_TIM5EN_bit				3
#define RCC_APB1ENR_TIM4EN_bit				2
#define RCC_APB1ENR_TIM3EN_bit				1
#define RCC_APB1ENR_TIM2EN_bit				0

#define RCC_APB1ENR_UART8EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_UART8EN_bit)
#define RCC_APB1ENR_UART7EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_UART7EN_bit)

#define RCC_APB1ENR_DACEN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_DACEN_bit)
#define RCC_APB1ENR_PWREN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_PWREN_bit)
#define RCC_APB1ENR_CECEN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_CECEN_bit)

#define RCC_APB1ENR_CAN3EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_CAN3EN_bit)
#define RCC_APB1ENR_CAN2EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_CAN2EN_bit)
#define RCC_APB1ENR_CAN1EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_CAN1EN_bit)

#define RCC_APB1ENR_FMPI2C1EN_bb			BITBAND(&RCC->APB1ENR, RCC_APB1ENR_FMPI2C1EN_bit)
#define RCC_APB1ENR_I2C3EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_I2C3EN_bit)
#define RCC_APB1ENR_I2C2EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_I2C2EN_bit)
#define RCC_APB1ENR_I2C1EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_I2C1EN_bit)

#define RCC_APB1ENR_UART5EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_UART5EN_bit)
#define RCC_APB1ENR_UART4EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_UART4EN_bit)
#define RCC_APB1ENR_USART3EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_USART3EN_bit)
#define RCC_APB1ENR_USART2EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_USART2EN_bit)

#define RCC_APB1ENR_SPDIFRXEN_bb			BITBAND(&RCC->APB1ENR, RCC_APB1ENR_SPDIFRXEN_bit)

#define RCC_APB1ENR_SPI3EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_SPI3EN_bit)
#define RCC_APB1ENR_SPI2EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_SPI2EN_bit)

#define RCC_APB1ENR_WWDGEN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_WWDGEN_bit)

#define RCC_APB1ENR_RTCAPBEN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_RTCAPBEN_bit)

#define RCC_APB1ENR_LPTIM1EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_LPTIM1EN_bit)
#define RCC_APB1ENR_TIM14EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_TIM14EN_bit)
#define RCC_APB1ENR_TIM13EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_TIM13EN_bit)
#define RCC_APB1ENR_TIM12EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_TIM12EN_bit)
#define RCC_APB1ENR_TIM7EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_TIM7EN_bit)
#define RCC_APB1ENR_TIM6EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_TIM6EN_bit)
#define RCC_APB1ENR_TIM5EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_TIM5EN_bit)
#define RCC_APB1ENR_TIM4EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_TIM4EN_bit)
#define RCC_APB1ENR_TIM3EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_TIM3EN_bit)
#define RCC_APB1ENR_TIM2EN_bb				BITBAND(&RCC->APB1ENR, RCC_APB1ENR_TIM2EN_bit)

/*---------------------------------------------------------------------------------------------------------------------+
| RCC_APB2ENR - RCC APB2 peripheral clock enable register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_APB2ENR_DSIEN_bit				27
#define RCC_APB2ENR_LTDCEN_bit				26

#define RCC_APB2ENR_DFSDM2EN_bit			25
#define RCC_APB2ENR_DFSDM1EN_bit			24

#define RCC_APB2ENR_SAI2EN_bit				23
#define RCC_APB2ENR_SAI1EN_bit				22

#define RCC_APB2ENR_SPI6EN_bit				21
#define RCC_APB2ENR_SPI5EN_bit				20

#define RCC_APB2ENR_TIM11EN_bit				18
#define RCC_APB2ENR_TIM10EN_bit				17
#define RCC_APB2ENR_TIM9EN_bit				16

#define RCC_APB2ENR_EXTIEN_bit				15
#define RCC_APB2ENR_SYSCFGEN_bit			14

#define RCC_APB2ENR_SPI4EN_bit				13
#define RCC_APB2ENR_SPI1EN_bit				12

#define RCC_APB2ENR_SDIOEN_bit				11

#define RCC_APB2ENR_ADC3EN_bit				10
#define RCC_APB2ENR_ADC2EN_bit				9
#define RCC_APB2ENR_ADC1EN_bit				8

#define RCC_APB2ENR_UART10EN_bit			7
#define RCC_APB2ENR_UART9EN_bit				6
#define RCC_APB2ENR_USART6EN_bit			5
#define RCC_APB2ENR_USART1EN_bit			4

#define RCC_APB2ENR_TIM8EN_bit				1
#define RCC_APB2ENR_TIM1EN_bit				0

#define RCC_APB2ENR_DSIEN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_DSIEN_bit)
#define RCC_APB2ENR_LTDCEN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_LTDCEN_bit)

#define RCC_APB2ENR_DFSDM2EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_DFSDM2EN_bit)
#define RCC_APB2ENR_DFSDM1EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_DFSDM1EN_bit)

#define RCC_APB2ENR_SAI2EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_SAI2EN_bit)
#define RCC_APB2ENR_SAI1EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_SAI1EN_bit)

#define RCC_APB2ENR_SPI6EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_SPI6EN_bit)
#define RCC_APB2ENR_SPI5EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_SPI5EN_bit)

#define RCC_APB2ENR_TIM11EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_TIM11EN_bit)
#define RCC_APB2ENR_TIM10EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_TIM10EN_bit)
#define RCC_APB2ENR_TIM9EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_TIM9EN_bit)

#define RCC_APB2ENR_EXTIEN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_EXTIEN_bit)
#define RCC_APB2ENR_SYSCFGEN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_SYSCFGEN_bit)

#define RCC_APB2ENR_SPI4EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_SPI4EN_bit)
#define RCC_APB2ENR_SPI1EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_SPI1EN_bit)

#define RCC_APB2ENR_SDIOEN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_SDIOEN_bit)

#define RCC_APB2ENR_ADC3EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_ADC3EN_bit)
#define RCC_APB2ENR_ADC2EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_ADC2EN_bit)
#define RCC_APB2ENR_ADC1EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_ADC1EN_bit)

#define RCC_APB2ENR_UART10EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_UART10EN_bit)
#define RCC_APB2ENR_UART9EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_UART9EN_bit)
#define RCC_APB2ENR_USART6EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_USART6EN_bit)
#define RCC_APB2ENR_USART1EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_USART1EN_bit)

#define RCC_APB2ENR_TIM8EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_TIM8EN_bit)
#define RCC_APB2ENR_TIM1EN_bb				BITBAND(&RCC->APB2ENR, RCC_APB2ENR_TIM1EN_bit)

