DISTORTEC/distortos/source/chip/STM32/STM32F4/include/distortos/chip/STM32F4-RCC-bits.h
/*---------------------------------------------------------------------------------------------------------------------+
| RCC_AHB1LPENR - RCC AHB1 peripheral clock enable in low power mode register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_AHB1LPENR_RNGLPEN_bit			31

#define RCC_AHB1LPENR_OTGHSULPILPEN_bit		30
#define RCC_AHB1LPENR_OTGHSLPEN_bit			29

#define RCC_AHB1LPENR_ETHMACPTPLPEN_bit		28
#define RCC_AHB1LPENR_ETHMACRXLPEN_bit		27
#define RCC_AHB1LPENR_ETHMACTXLPEN_bit		26
#define RCC_AHB1LPENR_ETHMACLPEN_bit		25

#define RCC_AHB1LPENR_DMA2DLPEN_bit			23
#define RCC_AHB1LPENR_DMA2LPEN_bit			22
#define RCC_AHB1LPENR_DMA1LPEN_bit			21

#define RCC_AHB1LPENR_SRAM3LPEN_bit			19
#define RCC_AHB1LPENR_BKPSRAMLPEN_bit		18
#define RCC_AHB1LPENR_SRAM2LPEN_bit			17
#define RCC_AHB1LPENR_SRAM1LPEN_bit			16

#define RCC_AHB1LPENR_FLITFLPEN_bit			15
#define RCC_AHB1LPENR_CRCLPEN_bit			12

#define RCC_AHB1LPENR_GPIOKLPEN_bit			10
#define RCC_AHB1LPENR_GPIOJLPEN_bit			9
#define RCC_AHB1LPENR_GPIOILPEN_bit			8
#define RCC_AHB1LPENR_GPIOHLPEN_bit			7
#define RCC_AHB1LPENR_GPIOGLPEN_bit			6
#define RCC_AHB1LPENR_GPIOFLPEN_bit			5
#define RCC_AHB1LPENR_GPIOELPEN_bit			4
#define RCC_AHB1LPENR_GPIODLPEN_bit			3
#define RCC_AHB1LPENR_GPIOCLPEN_bit			2
#define RCC_AHB1LPENR_GPIOBLPEN_bit			1
#define RCC_AHB1LPENR_GPIOALPEN_bit			0

#define RCC_AHB1LPENR_RNGLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_RNGLPEN_bit)

#define RCC_AHB1LPENR_OTGHSULPILPEN_bb		BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_OTGHSULPILPEN_bit)
#define RCC_AHB1LPENR_OTGHSLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_OTGHSLPEN_bit)

#define RCC_AHB1LPENR_ETHMACPTPLPEN_bb		BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_ETHMACPTPLPEN_bit)
#define RCC_AHB1LPENR_ETHMACRXLPEN_bb		BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_ETHMACRXLPEN_bit)
#define RCC_AHB1LPENR_ETHMACTXLPEN_bb		BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_ETHMACTXLPEN_bit)
#define RCC_AHB1LPENR_ETHMACLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_ETHMACLPEN_bit)

#define RCC_AHB1LPENR_DMA2DLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_DMA2DLPEN_bit)
#define RCC_AHB1LPENR_DMA2LPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_DMA2LPEN_bit)
#define RCC_AHB1LPENR_DMA1LPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_DMA1LPEN_bit)

#define RCC_AHB1LPENR_SRAM3LPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_SRAM3LPEN_bit)
#define RCC_AHB1LPENR_BKPSRAMLPEN_bb		BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_BKPSRAMLPEN_bit)
#define RCC_AHB1LPENR_SRAM2LPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_SRAM2LPEN_bit)
#define RCC_AHB1LPENR_SRAM1LPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_SRAM1LPEN_bit)

#define RCC_AHB1LPENR_FLITFLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_FLITFLPEN_bit)
#define RCC_AHB1LPENR_CRCLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_CRCLPEN_bit)

#define RCC_AHB1LPENR_GPIOKLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_GPIOKLPEN_bit)
#define RCC_AHB1LPENR_GPIOJLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_GPIOJLPEN_bit)
#define RCC_AHB1LPENR_GPIOILPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_GPIOILPEN_bit)
#define RCC_AHB1LPENR_GPIOHLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_GPIOHLPEN_bit)
#define RCC_AHB1LPENR_GPIOGLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_GPIOGLPEN_bit)
#define RCC_AHB1LPENR_GPIOFLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_GPIOFLPEN_bit)
#define RCC_AHB1LPENR_GPIOELPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_GPIOELPEN_bit)
#define RCC_AHB1LPENR_GPIODLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_GPIODLPEN_bit)
#define RCC_AHB1LPENR_GPIOCLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_GPIOCLPEN_bit)
#define RCC_AHB1LPENR_GPIOBLPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_GPIOBLPEN_bit)
#define RCC_AHB1LPENR_GPIOALPEN_bb			BITBAND(&RCC->AHB1LPENR, RCC_AHB1LPENR_GPIOALPEN_bit)

/*---------------------------------------------------------------------------------------------------------------------+
| RCC_AHB2LPENR - RCC AHB2 peripheral clock enable in low power mode register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_AHB2LPENR_OTGFSLPEN_bit			7
#define RCC_AHB2LPENR_RNGLPEN_bit			6
#define RCC_AHB2LPENR_HASHLPEN_bit			5
#define RCC_AHB2LPENR_CRYPLPEN_bit			4
#define RCC_AHB2LPENR_DCMILPEN_bit			0

#define RCC_AHB2LPENR_OTGFSLPEN_bb			BITBAND(&RCC->AHB2LPENR, RCC_AHB2LPENR_OTGFSLPEN_bit)
#define RCC_AHB2LPENR_RNGLPEN_bb			BITBAND(&RCC->AHB2LPENR, RCC_AHB2LPENR_RNGLPEN_bit)
#define RCC_AHB2LPENR_HASHLPEN_bb			BITBAND(&RCC->AHB2LPENR, RCC_AHB2LPENR_HASHLPEN_bit)
#define RCC_AHB2LPENR_CRYPLPEN_bb			BITBAND(&RCC->AHB2LPENR, RCC_AHB2LPENR_CRYPLPEN_bit)
#define RCC_AHB2LPENR_DCMILPEN_bb			BITBAND(&RCC->AHB2LPENR, RCC_AHB2LPENR_DCMILPEN_bit)

/*---------------------------------------------------------------------------------------------------------------------+
| RCC_AHB3LPENR - RCC AHB3 peripheral clock enable register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_AHB3LPENR_QSPILPEN_bit			1
#define RCC_AHB3LPENR_FMCLPEN_bit			0
#define RCC_AHB3LPENR_FSMCLPEN_bit			0

#define RCC_AHB3LPENR_QSPILPEN_bb			BITBAND(&RCC->AHB3LPENR, RCC_AHB3LPENR_QSPILPEN_bit)
#define RCC_AHB3LPENR_FMCLPEN_bb			BITBAND(&RCC->AHB3LPENR, RCC_AHB3LPENR_FMCLPEN_bit)
#define RCC_AHB3LPENR_FSMCLPEN_bb			BITBAND(&RCC->AHB3LPENR, RCC_AHB3LPENR_FSMCLPEN_bit)

/*---------------------------------------------------------------------------------------------------------------------+
| RCC_APB1LPENR - RCC APB1 peripheral clock enable in low power mode register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_APB1LPENR_UART8LPEN_bit			31
#define RCC_APB1LPENR_UART7LPEN_bit			30

#define RCC_APB1LPENR_DACLPEN_bit			29
#define RCC_APB1LPENR_PWRLPEN_bit			28

