DISTORTEC/distortos/source/chip/STM32/STM32F4/include/distortos/chip/STM32F4-RCC-bits.h
#define RCC_APB1LPENR_CECLPEN_bit			27

#define RCC_APB1LPENR_CAN3LPEN_bit			27
#define RCC_APB1LPENR_CAN2LPEN_bit			26
#define RCC_APB1LPENR_CAN1LPEN_bit			25

#define RCC_APB1LPENR_FMPI2C1LPEN_bit		24
#define RCC_APB1LPENR_I2C3LPEN_bit			23
#define RCC_APB1LPENR_I2C2LPEN_bit			22
#define RCC_APB1LPENR_I2C1LPEN_bit			21

#define RCC_APB1LPENR_UART5LPEN_bit			20
#define RCC_APB1LPENR_UART4LPEN_bit			19
#define RCC_APB1LPENR_USART3LPEN_bit		18
#define RCC_APB1LPENR_USART2LPEN_bit		17

#define RCC_APB1LPENR_SPDIFRXLPEN_bit		16

#define RCC_APB1LPENR_SPI3LPEN_bit			15
#define RCC_APB1LPENR_SPI2LPEN_bit			14

#define RCC_APB1LPENR_WWDGLPEN_bit			11

#define RCC_APB1LPENR_RTCAPBLPEN_bit		10

#define RCC_APB1LPENR_LPTIM1LPEN_bit		9
#define RCC_APB1LPENR_TIM14LPEN_bit			8
#define RCC_APB1LPENR_TIM13LPEN_bit			7
#define RCC_APB1LPENR_TIM12LPEN_bit			6
#define RCC_APB1LPENR_TIM7LPEN_bit			5
#define RCC_APB1LPENR_TIM6LPEN_bit			4
#define RCC_APB1LPENR_TIM5LPEN_bit			3
#define RCC_APB1LPENR_TIM4LPEN_bit			2
#define RCC_APB1LPENR_TIM3LPEN_bit			1
#define RCC_APB1LPENR_TIM2LPEN_bit			0

#define RCC_APB1LPENR_UART8LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_UART8LPEN_bit)
#define RCC_APB1LPENR_UART7LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_UART7LPEN_bit)

#define RCC_APB1LPENR_DACLPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_DACLPEN_bit)
#define RCC_APB1LPENR_PWRLPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_PWRLPEN_bit)

#define RCC_APB1LPENR_CECLPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_CECLPEN_bit)

#define RCC_APB1LPENR_CAN3LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_CAN3LPEN_bit)
#define RCC_APB1LPENR_CAN2LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_CAN2LPEN_bit)
#define RCC_APB1LPENR_CAN1LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_CAN1LPEN_bit)

#define RCC_APB1LPENR_FMPI2C1LPEN_bb		BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_FMPI2C1LPEN_bit)
#define RCC_APB1LPENR_I2C3LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_I2C3LPEN_bit)
#define RCC_APB1LPENR_I2C2LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_I2C2LPEN_bit)
#define RCC_APB1LPENR_I2C1LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_I2C1LPEN_bit)

#define RCC_APB1LPENR_UART5LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_UART5LPEN_bit)
#define RCC_APB1LPENR_UART4LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_UART4LPEN_bit)
#define RCC_APB1LPENR_USART3LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_USART3LPEN_bit)
#define RCC_APB1LPENR_USART2LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_USART2LPEN_bit)

#define RCC_APB1LPENR_SPDIFRXLPEN_bb		BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_SPDIFRXLPEN_bit)

#define RCC_APB1LPENR_SPI3LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_SPI3LPEN_bit)
#define RCC_APB1LPENR_SPI2LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_SPI2LPEN_bit)

#define RCC_APB1LPENR_WWDGLPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_WWDGLPEN_bit)

#define RCC_APB1LPENR_RTCAPBLPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_RTCAPBLPEN_bit)

#define RCC_APB1LPENR_LPTIM1LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_LPTIM1LPEN_bit)
#define RCC_APB1LPENR_TIM14LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_TIM14LPEN_bit)
#define RCC_APB1LPENR_TIM13LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_TIM13LPEN_bit)
#define RCC_APB1LPENR_TIM12LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_TIM12LPEN_bit)
#define RCC_APB1LPENR_TIM7LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_TIM7LPEN_bit)
#define RCC_APB1LPENR_TIM6LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_TIM6LPEN_bit)
#define RCC_APB1LPENR_TIM5LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_TIM5LPEN_bit)
#define RCC_APB1LPENR_TIM4LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_TIM4LPEN_bit)
#define RCC_APB1LPENR_TIM3LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_TIM3LPEN_bit)
#define RCC_APB1LPENR_TIM2LPEN_bb			BITBAND(&RCC->APB1LPENR, RCC_APB1LPENR_TIM2LPEN_bit)

/*---------------------------------------------------------------------------------------------------------------------+
| RCC_APB2LPENR - RCC APB2 peripheral clock enable register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_APB2LPENR_DSILPEN_bit			27
#define RCC_APB2LPENR_LTDCLPEN_bit			26

#define RCC_APB2LPENR_DFSDM2EN_bit			25
#define RCC_APB2LPENR_DFSDM1EN_bit			24

#define RCC_APB2LPENR_SAI2LPEN_bit			23
#define RCC_APB2LPENR_SAI1LPEN_bit			22

#define RCC_APB2LPENR_SPI6LPEN_bit			21
#define RCC_APB2LPENR_SPI5LPEN_bit			20

#define RCC_APB2LPENR_TIM11LPEN_bit			18
#define RCC_APB2LPENR_TIM10LPEN_bit			17
#define RCC_APB2LPENR_TIM9LPEN_bit			16

#define RCC_APB2LPENR_EXTILPEN_bit			15
#define RCC_APB2LPENR_EXTITLPEN_bit			15

#define RCC_APB2LPENR_SYSCFGLPEN_bit		14

#define RCC_APB2LPENR_SPI4LPEN_bit			13
#define RCC_APB2LPENR_SPI1LPEN_bit			12

#define RCC_APB2LPENR_SDIOLPEN_bit			11

#define RCC_APB2LPENR_ADC3LPEN_bit			10
#define RCC_APB2LPENR_ADC2LPEN_bit			9
#define RCC_APB2LPENR_ADC1LPEN_bit			8

#define RCC_APB2LPENR_UART10LPEN_bit		7
#define RCC_APB2LPENR_UART9LPEN_bit			6
#define RCC_APB2LPENR_USART6LPEN_bit		5
#define RCC_APB2LPENR_USART1LPEN_bit		4

#define RCC_APB2LPENR_TIM8LPEN_bit			1
#define RCC_APB2LPENR_TIM1LPEN_bit			0

#define RCC_APB2LPENR_DSILPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_DSILPEN_bit)
#define RCC_APB2LPENR_LTDCLPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_LTDCLPEN_bit)

#define RCC_APB2LPENR_DFSDM2EN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_DFSDM2EN_bit)
#define RCC_APB2LPENR_DFSDM1EN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_DFSDM1EN_bit)

#define RCC_APB2LPENR_SAI2LPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_SAI2LPEN_bit)
#define RCC_APB2LPENR_SAI1LPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_SAI1LPEN_bit)

#define RCC_APB2LPENR_SPI6LPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_SPI6LPEN_bit)
#define RCC_APB2LPENR_SPI5LPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_SPI5LPEN_bit)

#define RCC_APB2LPENR_TIM11LPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_TIM11LPEN_bit)
#define RCC_APB2LPENR_TIM10LPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_TIM10LPEN_bit)
#define RCC_APB2LPENR_TIM9LPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_TIM9LPEN_bit)

#define RCC_APB2LPENR_EXTILPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_EXTILPEN_bit)
#define RCC_APB2LPENR_EXTITLPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_EXTITLPEN_bit)

#define RCC_APB2LPENR_SYSCFGLPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_SYSCFGLPEN_bit)

#define RCC_APB2LPENR_SPI4LPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_SPI4LPEN_bit)
#define RCC_APB2LPENR_SPI1LPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_SPI1LPEN_bit)

#define RCC_APB2LPENR_SDIOLPEN_bb			BITBAND(&RCC->APB2LPENR, RCC_APB2LPENR_SDIOLPEN_bit)

