DISTORTEC/distortos/source/chip/STM32/STM32F4/include/distortos/chip/STM32F4-RCC-bits.h
/*---------------------------------------------------------------------------------------------------------------------+
| RCC_PLLI2SCFGR - RCC PLLI2S configuration register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_PLLI2SCFGR_PLLI2SR_bit			28
#define RCC_PLLI2SCFGR_PLLI2SR_0_bit		28
#define RCC_PLLI2SCFGR_PLLI2SR_1_bit		29
#define RCC_PLLI2SCFGR_PLLI2SR_2_bit		30

#define RCC_PLLI2SCFGR_PLLI2SQ_bit			24
#define RCC_PLLI2SCFGR_PLLI2SQ_0_bit		24
#define RCC_PLLI2SCFGR_PLLI2SQ_1_bit		25
#define RCC_PLLI2SCFGR_PLLI2SQ_2_bit		26
#define RCC_PLLI2SCFGR_PLLI2SQ_3_bit		27

#define RCC_PLLI2SCFGR_PLLI2SSRC_bit		22

#define RCC_PLLI2SCFGR_PLLI2SP_bit			16
#define RCC_PLLI2SCFGR_PLLI2SP_0_bit		16
#define RCC_PLLI2SCFGR_PLLI2SP_1_bit		17

#define RCC_PLLI2SCFGR_PLLI2SN_bit			6
#define RCC_PLLI2SCFGR_PLLI2SN_0_bit		6
#define RCC_PLLI2SCFGR_PLLI2SN_1_bit		7
#define RCC_PLLI2SCFGR_PLLI2SN_2_bit		8
#define RCC_PLLI2SCFGR_PLLI2SN_3_bit		9
#define RCC_PLLI2SCFGR_PLLI2SN_4_bit		10
#define RCC_PLLI2SCFGR_PLLI2SN_5_bit		11
#define RCC_PLLI2SCFGR_PLLI2SN_6_bit		12
#define RCC_PLLI2SCFGR_PLLI2SN_7_bit		13
#define RCC_PLLI2SCFGR_PLLI2SN_8_bit		14

#define RCC_PLLI2SCFGR_PLLI2SM_bit			0
#define RCC_PLLI2SCFGR_PLLI2SM_0_bit		0
#define RCC_PLLI2SCFGR_PLLI2SM_1_bit		1
#define RCC_PLLI2SCFGR_PLLI2SM_2_bit		2
#define RCC_PLLI2SCFGR_PLLI2SM_3_bit		3
#define RCC_PLLI2SCFGR_PLLI2SM_4_bit		4
#define RCC_PLLI2SCFGR_PLLI2SM_5_bit		5

#define RCC_PLLI2SCFGR_PLLI2SP_DIV2_value	0
#define RCC_PLLI2SCFGR_PLLI2SP_DIV4_value	1
#define RCC_PLLI2SCFGR_PLLI2SP_DIV6_value	2
#define RCC_PLLI2SCFGR_PLLI2SP_DIV8_value	3
#define RCC_PLLI2SCFGR_PLLI2SP_mask			3

#define RCC_PLLI2SCFGR_PLLI2SP_DIV2			(RCC_PLLI2SCFGR_PLLI2SP_DIV2_value << RCC_PLLI2SCFGR_PLLI2SP_bit)
#define RCC_PLLI2SCFGR_PLLI2SP_DIV4			(RCC_PLLI2SCFGR_PLLI2SP_DIV4_value << RCC_PLLI2SCFGR_PLLI2SP_bit)
#define RCC_PLLI2SCFGR_PLLI2SP_DIV6			(RCC_PLLI2SCFGR_PLLI2SP_DIV6_value << RCC_PLLI2SCFGR_PLLI2SP_bit)
#define RCC_PLLI2SCFGR_PLLI2SP_DIV8			(RCC_PLLI2SCFGR_PLLI2SP_DIV8_value << RCC_PLLI2SCFGR_PLLI2SP_bit)

#define RCC_PLLI2SCFGR_PLLI2SR_0_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SR_0_bit)
#define RCC_PLLI2SCFGR_PLLI2SR_1_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SR_1_bit)
#define RCC_PLLI2SCFGR_PLLI2SR_2_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SR_2_bit)

#define RCC_PLLI2SCFGR_PLLI2SQ_0_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SQ_0_bit)
#define RCC_PLLI2SCFGR_PLLI2SQ_1_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SQ_1_bit)
#define RCC_PLLI2SCFGR_PLLI2SQ_2_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SQ_2_bit)
#define RCC_PLLI2SCFGR_PLLI2SQ_3_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SQ_3_bit)

#define RCC_PLLI2SCFGR_PLLI2SSRC_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SSRC_bit)

#define RCC_PLLI2SCFGR_PLLI2SP_0_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SP_0_bit)
#define RCC_PLLI2SCFGR_PLLI2SP_1_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SP_1_bit)

#define RCC_PLLI2SCFGR_PLLI2SN_0_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SN_0_bit)
#define RCC_PLLI2SCFGR_PLLI2SN_1_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SN_1_bit)
#define RCC_PLLI2SCFGR_PLLI2SN_2_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SN_2_bit)
#define RCC_PLLI2SCFGR_PLLI2SN_3_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SN_3_bit)
#define RCC_PLLI2SCFGR_PLLI2SN_4_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SN_4_bit)
#define RCC_PLLI2SCFGR_PLLI2SN_5_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SN_5_bit)
#define RCC_PLLI2SCFGR_PLLI2SN_6_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SN_6_bit)
#define RCC_PLLI2SCFGR_PLLI2SN_7_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SN_7_bit)
#define RCC_PLLI2SCFGR_PLLI2SN_8_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SN_8_bit)

#define RCC_PLLI2SCFGR_PLLI2SM_0_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SM_0_bit)
#define RCC_PLLI2SCFGR_PLLI2SM_1_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SM_1_bit)
#define RCC_PLLI2SCFGR_PLLI2SM_2_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SM_2_bit)
#define RCC_PLLI2SCFGR_PLLI2SM_3_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SM_3_bit)
#define RCC_PLLI2SCFGR_PLLI2SM_4_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SM_4_bit)
#define RCC_PLLI2SCFGR_PLLI2SM_5_bb			BITBAND(&RCC->PLLI2SCFGR, RCC_PLLI2SCFGR_PLLI2SM_5_bit)

/*---------------------------------------------------------------------------------------------------------------------+
| RCC_PLLSAICFGR - RCC PLL configuration register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_PLLSAICFGR_PLLSAIR_bit			28
#define RCC_PLLSAICFGR_PLLSAIR_0_bit		28
#define RCC_PLLSAICFGR_PLLSAIR_1_bit		29
#define RCC_PLLSAICFGR_PLLSAIR_2_bit		30

#define RCC_PLLSAICFGR_PLLSAIQ_bit			24
#define RCC_PLLSAICFGR_PLLSAIQ_0_bit		24
#define RCC_PLLSAICFGR_PLLSAIQ_1_bit		25
#define RCC_PLLSAICFGR_PLLSAIQ_2_bit		26
#define RCC_PLLSAICFGR_PLLSAIQ_3_bit		27

#define RCC_PLLSAICFGR_PLLSAIP_bit			16
#define RCC_PLLSAICFGR_PLLSAIP_0_bit		16
#define RCC_PLLSAICFGR_PLLSAIP_1_bit		17

#define RCC_PLLSAICFGR_PLLSAIN_bit			6
#define RCC_PLLSAICFGR_PLLSAIN_0_bit		6
#define RCC_PLLSAICFGR_PLLSAIN_1_bit		7
#define RCC_PLLSAICFGR_PLLSAIN_2_bit		8
#define RCC_PLLSAICFGR_PLLSAIN_3_bit		9
#define RCC_PLLSAICFGR_PLLSAIN_4_bit		10
#define RCC_PLLSAICFGR_PLLSAIN_5_bit		11
#define RCC_PLLSAICFGR_PLLSAIN_6_bit		12
#define RCC_PLLSAICFGR_PLLSAIN_7_bit		13
#define RCC_PLLSAICFGR_PLLSAIN_8_bit		14

#define RCC_PLLSAICFGR_PLLSAIM_bit			0
#define RCC_PLLSAICFGR_PLLSAIM_0_bit		0
#define RCC_PLLSAICFGR_PLLSAIM_1_bit		1
#define RCC_PLLSAICFGR_PLLSAIM_2_bit		2
#define RCC_PLLSAICFGR_PLLSAIM_3_bit		3
#define RCC_PLLSAICFGR_PLLSAIM_4_bit		4
#define RCC_PLLSAICFGR_PLLSAIM_5_bit		5

#define RCC_PLLSAICFGR_PLLSAIP_DIV2_value	2
#define RCC_PLLSAICFGR_PLLSAIP_DIV4_value	3
#define RCC_PLLSAICFGR_PLLSAIP_DIV6_value	4
#define RCC_PLLSAICFGR_PLLSAIP_DIV8_value	5
#define RCC_PLLSAICFGR_PLLSAIP_mask			3

#define RCC_PLLSAICFGR_PLLSAIP_DIV2			(RCC_PLLSAICFGR_PLLSAIP_DIV2_value << RCC_PLLSAICFGR_PLLSAIP_bit)
#define RCC_PLLSAICFGR_PLLSAIP_DIV4			(RCC_PLLSAICFGR_PLLSAIP_DIV4_value << RCC_PLLSAICFGR_PLLSAIP_bit)
#define RCC_PLLSAICFGR_PLLSAIP_DIV6			(RCC_PLLSAICFGR_PLLSAIP_DIV6_value << RCC_PLLSAICFGR_PLLSAIP_bit)
#define RCC_PLLSAICFGR_PLLSAIP_DIV8			(RCC_PLLSAICFGR_PLLSAIP_DIV8_value << RCC_PLLSAICFGR_PLLSAIP_bit)

