DISTORTEC/distortos/source/chip/STM32/STM32F4/include/distortos/chip/STM32F4-RCC-bits.h
#define RCC_PLLSAICFGR_PLLSAIR_0_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIR_0_bit)
#define RCC_PLLSAICFGR_PLLSAIR_1_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIR_1_bit)
#define RCC_PLLSAICFGR_PLLSAIR_2_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIR_2_bit)

#define RCC_PLLSAICFGR_PLLSAIQ_0_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIQ_0_bit)
#define RCC_PLLSAICFGR_PLLSAIQ_1_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIQ_1_bit)
#define RCC_PLLSAICFGR_PLLSAIQ_2_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIQ_2_bit)
#define RCC_PLLSAICFGR_PLLSAIQ_3_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIQ_3_bit)

#define RCC_PLLSAICFGR_PLLSAIP_0_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIP_0_bit)
#define RCC_PLLSAICFGR_PLLSAIP_1_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIP_1_bit)

#define RCC_PLLSAICFGR_PLLSAIN_0_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIN_0_bit)
#define RCC_PLLSAICFGR_PLLSAIN_1_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIN_1_bit)
#define RCC_PLLSAICFGR_PLLSAIN_2_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIN_2_bit)
#define RCC_PLLSAICFGR_PLLSAIN_3_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIN_3_bit)
#define RCC_PLLSAICFGR_PLLSAIN_4_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIN_4_bit)
#define RCC_PLLSAICFGR_PLLSAIN_5_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIN_5_bit)
#define RCC_PLLSAICFGR_PLLSAIN_6_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIN_6_bit)
#define RCC_PLLSAICFGR_PLLSAIN_7_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIN_7_bit)
#define RCC_PLLSAICFGR_PLLSAIN_8_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIN_8_bit)

#define RCC_PLLSAICFGR_PLLSAIM_0_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIM_0_bit)
#define RCC_PLLSAICFGR_PLLSAIM_1_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIM_1_bit)
#define RCC_PLLSAICFGR_PLLSAIM_2_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIM_2_bit)
#define RCC_PLLSAICFGR_PLLSAIM_3_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIM_3_bit)
#define RCC_PLLSAICFGR_PLLSAIM_4_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIM_4_bit)
#define RCC_PLLSAICFGR_PLLSAIM_5_bb			BITBAND(&RCC->PLLSAICFGR, RCC_PLLSAICFGR_PLLSAIM_5_bit)

/*---------------------------------------------------------------------------------------------------------------------+
| RCC_DCKCFGR - RCC Dedicated Clock Configuration Register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_DCKCFGR_CKDFSDM1SEL_bit			31
#define RCC_DCKCFGR_DSISEL_bit				29
#define RCC_DCKCFGR_SDIOSEL_bit				28
#define RCC_DCKCFGR_48MSEL_bit				27

#define RCC_DCKCFGR_I2S2SRC_bit				27
#define RCC_DCKCFGR_I2S2SRC_0_bit			27
#define RCC_DCKCFGR_I2S2SRC_1_bit			28

#define RCC_DCKCFGR_I2S1SRC_bit				25
#define RCC_DCKCFGR_I2S1SRC_0_bit			25
#define RCC_DCKCFGR_I2S1SRC_1_bit			26

#define RCC_DCKCFGR_I2SSRC_bit				25
#define RCC_DCKCFGR_I2SSRC_0_bit			25
#define RCC_DCKCFGR_I2SSRC_1_bit			26

#define RCC_DCKCFGR_TIMPRE_bit				24

#define RCC_DCKCFGR_SAI1BSRC_bit			22
#define RCC_DCKCFGR_SAI1BSRC_0_bit			22
#define RCC_DCKCFGR_SAI1BSRC_1_bit			23

#define RCC_DCKCFGR_SAI1ASRC_bit			20
#define RCC_DCKCFGR_SAI1ASRC_0_bit			20
#define RCC_DCKCFGR_SAI1ASRC_1_bit			21

#define RCC_DCKCFGR_SAI2SRC_bit				22
#define RCC_DCKCFGR_SAI2SRC_0_bit			22
#define RCC_DCKCFGR_SAI2SRC_1_bit			23

#define RCC_DCKCFGR_SAI1SRC_bit				20
#define RCC_DCKCFGR_SAI1SRC_0_bit			20
#define RCC_DCKCFGR_SAI1SRC_1_bit			21

#define RCC_DCKCFGR_PLLSAIDIVR_bit			16
#define RCC_DCKCFGR_PLLSAIDIVR_0_bit		16
#define RCC_DCKCFGR_PLLSAIDIVR_1_bit		17

#define RCC_DCKCFGR_CKDFSDM1ASEL_bit		15
#define RCC_DCKCFGR_CKDFSDM2ASEL_bit		14

#define RCC_DCKCFGR_PLLSAIDIVQ_bit			8
#define RCC_DCKCFGR_PLLSAIDIVQ_0_bit		8
#define RCC_DCKCFGR_PLLSAIDIVQ_1_bit		9
#define RCC_DCKCFGR_PLLSAIDIVQ_2_bit		10
#define RCC_DCKCFGR_PLLSAIDIVQ_3_bit		11
#define RCC_DCKCFGR_PLLSAIDIVQ_4_bit		12

#define RCC_DCKCFGR_PLLDIVR_bit				8
#define RCC_DCKCFGR_PLLDIVR_0_bit			8
#define RCC_DCKCFGR_PLLDIVR_1_bit			9
#define RCC_DCKCFGR_PLLDIVR_2_bit			10
#define RCC_DCKCFGR_PLLDIVR_3_bit			11
#define RCC_DCKCFGR_PLLDIVR_4_bit			12

#define RCC_DCKCFGR_PLLI2SDIVQ_bit			0
#define RCC_DCKCFGR_PLLI2SDIVQ_0_bit		0
#define RCC_DCKCFGR_PLLI2SDIVQ_1_bit		1
#define RCC_DCKCFGR_PLLI2SDIVQ_2_bit		2
#define RCC_DCKCFGR_PLLI2SDIVQ_3_bit		3
#define RCC_DCKCFGR_PLLI2SDIVQ_4_bit		4

#define RCC_DCKCFGR_PLLI2SDIVR_bit			0
#define RCC_DCKCFGR_PLLI2SDIVR_0_bit		0
#define RCC_DCKCFGR_PLLI2SDIVR_1_bit		1
#define RCC_DCKCFGR_PLLI2SDIVR_2_bit		2
#define RCC_DCKCFGR_PLLI2SDIVR_3_bit		3
#define RCC_DCKCFGR_PLLI2SDIVR_4_bit		4

#define RCC_DCKCFGR_I2S2SRC_PLLI2S_R_value	0
#define RCC_DCKCFGR_I2S2SRC_I2S_CKIN_value	1
#define RCC_DCKCFGR_I2S2SRC_PLL_R_value		2
#define RCC_DCKCFGR_I2S2SRC_HSI_HSE_value	3
#define RCC_DCKCFGR_I2S2SRC_mask			3

#define RCC_DCKCFGR_I2S1SRC_PLLI2S_R_value	0
#define RCC_DCKCFGR_I2S1SRC_I2S_CKIN_value	1
#define RCC_DCKCFGR_I2S1SRC_PLL_R_value		2
#define RCC_DCKCFGR_I2S1SRC_HSI_HSE_value	3
#define RCC_DCKCFGR_I2S1SRC_mask			3

#define RCC_DCKCFGR_I2SSRC_PLL_R_value		0
#define RCC_DCKCFGR_I2SSRC_I2S_CKIN_value	1
#define RCC_DCKCFGR_I2SSRC_HSI_HSE_value	3
#define RCC_DCKCFGR_I2SSRC_mask				3

#define RCC_DCKCFGR_SAI1BSRC_PLLSAI_Q_DIV_value	0
#define RCC_DCKCFGR_SAI1BSRC_PLLI2S_Q_DIV_value	1
#define RCC_DCKCFGR_SAI1BSRC_I2S_CKIN_value		2
#define RCC_DCKCFGR_SAI1BSRC_mask				3

#define RCC_DCKCFGR_SAI1ASRC_PLLSAI_Q_DIV_value	0
#define RCC_DCKCFGR_SAI1ASRC_PLLI2S_Q_DIV_value	1
#define RCC_DCKCFGR_SAI1ASRC_I2S_CKIN_value		2
#define RCC_DCKCFGR_SAI1ASRC_mask				3

#define RCC_DCKCFGR_SAI2SRC_PLLSAI_Q_DIV_value	0
#define RCC_DCKCFGR_SAI2SRC_PLLI2S_Q_DIV_value	1
#define RCC_DCKCFGR_SAI2SRC_PLL_R_value			2
#define RCC_DCKCFGR_SAI2SRC_HSI_HSE_value		3
#define RCC_DCKCFGR_SAI2SRC_mask				3

#define RCC_DCKCFGR_SAI1SRC_PLLSAI_Q_DIV_value	0
#define RCC_DCKCFGR_SAI1SRC_PLLI2S_Q_DIV_value	1
#define RCC_DCKCFGR_SAI1SRC_PLL_R_value			2
#define RCC_DCKCFGR_SAI1SRC_I2S_CKIN_value		3
#define RCC_DCKCFGR_SAI1SRC_mask				3

#define RCC_DCKCFGR_PLLSAIDIVR_DIV2_value	0
#define RCC_DCKCFGR_PLLSAIDIVR_DIV4_value	1
#define RCC_DCKCFGR_PLLSAIDIVR_DIV8_value	2
#define RCC_DCKCFGR_PLLSAIDIVR_DIV16_value	3
#define RCC_DCKCFGR_PLLSAIDIVR_mask			3

#define RCC_DCKCFGR_I2S2SRC_PLLI2S_R		(RCC_DCKCFGR_I2S2SRC_PLLI2S_R_value << RCC_DCKCFGR_I2S2SRC_bit)
#define RCC_DCKCFGR_I2S2SRC_I2S_CKIN		(RCC_DCKCFGR_I2S2SRC_I2S_CKIN_value << RCC_DCKCFGR_I2S2SRC_bit)
#define RCC_DCKCFGR_I2S2SRC_PLL_R			(RCC_DCKCFGR_I2S2SRC_PLL_R_value << RCC_DCKCFGR_I2S2SRC_bit)
#define RCC_DCKCFGR_I2S2SRC_HSI_HSE			(RCC_DCKCFGR_I2S2SRC_HSI_HSE_value << RCC_DCKCFGR_I2S2SRC_bit)

#define RCC_DCKCFGR_I2S1SRC_PLLI2S_R		(RCC_DCKCFGR_I2S1SRC_PLLI2S_R_value << RCC_DCKCFGR_I2S1SRC_bit)
#define RCC_DCKCFGR_I2S1SRC_I2S_CKIN		(RCC_DCKCFGR_I2S1SRC_I2S_CKIN_value << RCC_DCKCFGR_I2S1SRC_bit)
#define RCC_DCKCFGR_I2S1SRC_PLL_R			(RCC_DCKCFGR_I2S1SRC_PLL_R_value << RCC_DCKCFGR_I2S1SRC_bit)
#define RCC_DCKCFGR_I2S1SRC_HSI_HSE			(RCC_DCKCFGR_I2S1SRC_HSI_HSE_value << RCC_DCKCFGR_I2S1SRC_bit)

