DISTORTEC/distortos/source/chip/STM32/STM32F4/include/distortos/chip/STM32F4-RCC-bits.h
#define RCC_DCKCFGR_I2SSRC_PLL_R			(RCC_DCKCFGR_I2SSRC_PLL_R_value << RCC_DCKCFGR_I2SSRC_bit)
#define RCC_DCKCFGR_I2SSRC_I2S_CKIN			(RCC_DCKCFGR_I2SSRC_I2S_CKIN_value << RCC_DCKCFGR_I2SSRC_bit)
#define RCC_DCKCFGR_I2SSRC_HSI_HSE			(RCC_DCKCFGR_I2SSRC_HSI_HSE_value << RCC_DCKCFGR_I2SSRC_bit)

#define RCC_DCKCFGR_SAI1BSRC_PLLSAI_Q_DIV	(RCC_DCKCFGR_SAI1BSRC_PLLSAI_Q_DIV_value << RCC_DCKCFGR_SAI1BSRC_bit)
#define RCC_DCKCFGR_SAI1BSRC_PLLI2S_Q_DIV	(RCC_DCKCFGR_SAI1BSRC_PLLI2S_Q_DIV_value << RCC_DCKCFGR_SAI1BSRC_bit)
#define RCC_DCKCFGR_SAI1BSRC_I2S_CKIN		(RCC_DCKCFGR_SAI1BSRC_I2S_CKIN_value << RCC_DCKCFGR_SAI1BSRC_bit)

#define RCC_DCKCFGR_SAI1ASRC_PLLSAI_Q_DIV	(RCC_DCKCFGR_SAI1ASRC_PLLSAI_Q_DIV_value << RCC_DCKCFGR_SAI1ASRC_bit)
#define RCC_DCKCFGR_SAI1ASRC_PLLI2S_Q_DIV	(RCC_DCKCFGR_SAI1ASRC_PLLI2S_Q_DIV_value << RCC_DCKCFGR_SAI1ASRC_bit)
#define RCC_DCKCFGR_SAI1ASRC_I2S_CKIN		(RCC_DCKCFGR_SAI1ASRC_I2S_CKIN_value << RCC_DCKCFGR_SAI1ASRC_bit)

#define RCC_DCKCFGR_SAI2SRC_PLLSAI_Q_DIV	(RCC_DCKCFGR_SAI2SRC_PLLSAI_Q_DIV_value << RCC_DCKCFGR_SAI2SRC_bit)
#define RCC_DCKCFGR_SAI2SRC_PLLI2S_Q_DIV	(RCC_DCKCFGR_SAI2SRC_PLLI2S_Q_DIV_value << RCC_DCKCFGR_SAI2SRC_bit)
#define RCC_DCKCFGR_SAI2SRC_PLL_R			(RCC_DCKCFGR_SAI2SRC_PLL_R_value << RCC_DCKCFGR_SAI2SRC_bit)
#define RCC_DCKCFGR_SAI2SRC_HSI_HSE			(RCC_DCKCFGR_SAI2SRC_HSI_HSE_value << RCC_DCKCFGR_SAI2SRC_bit)

#define RCC_DCKCFGR_SAI1SRC_PLLSAI_Q_DIV	(RCC_DCKCFGR_SAI1SRC_PLLSAI_Q_DIV_value << RCC_DCKCFGR_SAI1SRC_bit)
#define RCC_DCKCFGR_SAI1SRC_PLLI2S_Q_DIV	(RCC_DCKCFGR_SAI1SRC_PLLI2S_Q_DIV_value << RCC_DCKCFGR_SAI1SRC_bit)
#define RCC_DCKCFGR_SAI1SRC_PLL_R			(RCC_DCKCFGR_SAI1SRC_PLL_R_value << RCC_DCKCFGR_SAI1SRC_bit)
#define RCC_DCKCFGR_SAI1SRC_I2S_CKIN		(RCC_DCKCFGR_SAI1SRC_I2S_CKIN_value << RCC_DCKCFGR_SAI1SRC_bit)

#define RCC_DCKCFGR_PLLSAIDIVR_DIV2			(RCC_DCKCFGR_PLLSAIDIVR_DIV2_value << RCC_DCKCFGR_PLLSAIDIVR_bit)
#define RCC_DCKCFGR_PLLSAIDIVR_DIV4			(RCC_DCKCFGR_PLLSAIDIVR_DIV4_value << RCC_DCKCFGR_PLLSAIDIVR_bit)
#define RCC_DCKCFGR_PLLSAIDIVR_DIV8			(RCC_DCKCFGR_PLLSAIDIVR_DIV8_value << RCC_DCKCFGR_PLLSAIDIVR_bit)
#define RCC_DCKCFGR_PLLSAIDIVR_DIV16		(RCC_DCKCFGR_PLLSAIDIVR_DIV16_value << RCC_DCKCFGR_PLLSAIDIVR_bit)

#define RCC_DCKCFGR_CKDFSDM1SEL_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_CKDFSDM1SEL_bit)
#define RCC_DCKCFGR_DSISEL_bb				BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_DSISEL_bit)
#define RCC_DCKCFGR_SDIOSEL_bb				BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_SDIOSEL_bit)
#define RCC_DCKCFGR_48MSEL_bb				BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_48MSEL_bit)

#define RCC_DCKCFGR_I2S2SRC_0_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_I2S2SRC_0_bit)
#define RCC_DCKCFGR_I2S2SRC_1_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_I2S2SRC_1_bit)

#define RCC_DCKCFGR_I2S1SRC_0_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_I2S1SRC_0_bit)
#define RCC_DCKCFGR_I2S1SRC_1_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_I2S1SRC_1_bit)

#define RCC_DCKCFGR_I2SSRC_0_bb				BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_I2SSRC_0_bit)
#define RCC_DCKCFGR_I2SSRC_1_bb				BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_I2SSRC_1_bit)

#define RCC_DCKCFGR_TIMPRE_bb				BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_TIMPRE_bit)

#define RCC_DCKCFGR_SAI1BSRC_0_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_SAI1BSRC_0_bit)
#define RCC_DCKCFGR_SAI1BSRC_1_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_SAI1BSRC_1_bit)

#define RCC_DCKCFGR_SAI1ASRC_0_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_SAI1ASRC_0_bit)
#define RCC_DCKCFGR_SAI1ASRC_1_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_SAI1ASRC_1_bit)

#define RCC_DCKCFGR_SAI2SRC_0_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_SAI2SRC_0_bit)
#define RCC_DCKCFGR_SAI2SRC_1_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_SAI2SRC_1_bit)

#define RCC_DCKCFGR_SAI1SRC_0_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_SAI1SRC_0_bit)
#define RCC_DCKCFGR_SAI1SRC_1_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_SAI1SRC_1_bit)

#define RCC_DCKCFGR_PLLSAIDIVR_0_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLSAIDIVR_0_bit)
#define RCC_DCKCFGR_PLLSAIDIVR_1_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLSAIDIVR_1_bit)

#define RCC_DCKCFGR_CKDFSDM1ASEL_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_CKDFSDM1ASEL_bit)
#define RCC_DCKCFGR_CKDFSDM2ASEL_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_CKDFSDM2ASEL_bit)

#define RCC_DCKCFGR_PLLSAIDIVQ_0_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLSAIDIVQ_0_bit)
#define RCC_DCKCFGR_PLLSAIDIVQ_1_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLSAIDIVQ_1_bit)
#define RCC_DCKCFGR_PLLSAIDIVQ_2_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLSAIDIVQ_2_bit)
#define RCC_DCKCFGR_PLLSAIDIVQ_3_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLSAIDIVQ_3_bit)
#define RCC_DCKCFGR_PLLSAIDIVQ_4_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLSAIDIVQ_4_bit)

#define RCC_DCKCFGR_PLLDIVR_0_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLDIVR_0_bit)
#define RCC_DCKCFGR_PLLDIVR_1_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLDIVR_1_bit)
#define RCC_DCKCFGR_PLLDIVR_2_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLDIVR_2_bit)
#define RCC_DCKCFGR_PLLDIVR_3_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLDIVR_3_bit)
#define RCC_DCKCFGR_PLLDIVR_4_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLDIVR_4_bit)

#define RCC_DCKCFGR_PLLI2SDIVQ_0_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLI2SDIVQ_0_bit)
#define RCC_DCKCFGR_PLLI2SDIVQ_1_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLI2SDIVQ_1_bit)
#define RCC_DCKCFGR_PLLI2SDIVQ_2_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLI2SDIVQ_2_bit)
#define RCC_DCKCFGR_PLLI2SDIVQ_3_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLI2SDIVQ_3_bit)
#define RCC_DCKCFGR_PLLI2SDIVQ_4_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLLI2SDIVQ_4_bit)

#define RCC_DCKCFGR_PLL2SDIVR_0_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLL2SDIVR_0_bit)
#define RCC_DCKCFGR_PLL2SDIVR_1_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLL2SDIVR_1_bit)
#define RCC_DCKCFGR_PLL2SDIVR_2_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLL2SDIVR_2_bit)
#define RCC_DCKCFGR_PLL2SDIVR_3_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLL2SDIVR_3_bit)
#define RCC_DCKCFGR_PLL2SDIVR_4_bb			BITBAND(&RCC->DCKCFGR, RCC_DCKCFGR_PLL2SDIVR_4_bit)

/*---------------------------------------------------------------------------------------------------------------------+
| RCC_CKGATENR - RCC clocks gated enable register
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_CKGATENR_EVTCL_CKEN_bit			7
#define RCC_CKGATENR_RCC_CKEN_bit			6
#define RCC_CKGATENR_FLITF_CKEN_bit			5
#define RCC_CKGATENR_SRAM_CKEN_bit			4
#define RCC_CKGATENR_SPARE_CKEN_bit			3
#define RCC_CKGATENR_CM4DBG_CKEN_bit		2
#define RCC_CKGATENR_AHB2APB2_CKEN_bit		1
#define RCC_CKGATENR_AHB2APB1_CKEN_bit		0

#define RCC_CKGATENR_EVTCL_CKEN_bb			BITBAND(&RCC->CKGATENR, RCC_CKGATENR_EVTCL_CKEN_bit)
#define RCC_CKGATENR_RCC_CKEN_bb			BITBAND(&RCC->CKGATENR, RCC_CKGATENR_RCC_CKEN_bit)
#define RCC_CKGATENR_FLITF_CKEN_bb			BITBAND(&RCC->CKGATENR, RCC_CKGATENR_FLITF_CKEN_bit)
#define RCC_CKGATENR_SRAM_CKEN_bb			BITBAND(&RCC->CKGATENR, RCC_CKGATENR_SRAM_CKEN_bit)
#define RCC_CKGATENR_SPARE_CKEN_bb			BITBAND(&RCC->CKGATENR, RCC_CKGATENR_SPARE_CKEN_bit)
#define RCC_CKGATENR_CM4DBG_CKEN_bb			BITBAND(&RCC->CKGATENR, RCC_CKGATENR_CM4DBG_CKEN_bit)
#define RCC_CKGATENR_AHB2APB2_CKEN_bb		BITBAND(&RCC->CKGATENR, RCC_CKGATENR_AHB2APB2_CKEN_bit)
#define RCC_CKGATENR_AHB2APB1_CKEN_bb		BITBAND(&RCC->CKGATENR, RCC_CKGATENR_AHB2APB1_CKEN_bit)

