DISTORTEC/distortos/source/chip/STM32/STM32F4/include/distortos/chip/STM32F4-RCC-bits.h
/*---------------------------------------------------------------------------------------------------------------------+
| RCC_DCKCFGR2 - RCC dedicated clocks configuration register 2
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_DCKCFGR2_LPTIM1SEL_bit			30
#define RCC_DCKCFGR2_LPTIM1SEL_0_bit		30
#define RCC_DCKCFGR2_LPTIM1SEL_1_bit		31

#define RCC_DCKCFGR2_SPDIFRXSEL_bit			29
#define RCC_DCKCFGR2_SDIOSEL_bit			28
#define RCC_DCKCFGR2_CK48MSEL_bit			27
#define RCC_DCKCFGR2_CECSEL_bit				26

#define RCC_DCKCFGR2_FMPI2C1SEL_bit			22
#define RCC_DCKCFGR2_FMPI2C1SEL_0_bit		22
#define RCC_DCKCFGR2_FMPI2C1SEL_1_bit		23

#define RCC_DCKCFGR2_LPTIM1SEL_APB_value	0
#define RCC_DCKCFGR2_LPTIM1SEL_HSI_value	1
#define RCC_DCKCFGR2_LPTIM1SEL_LSI_value	2
#define RCC_DCKCFGR2_LPTIM1SEL_LSE_value	3
#define RCC_DCKCFGR2_LPTIM1SEL_mask			3

#define RCC_DCKCFGR2_FMPI2C1SEL_APB_value		0
#define RCC_DCKCFGR2_FMPI2C1SEL_SYSCLK_value	1
#define RCC_DCKCFGR2_FMPI2C1SEL_HSI_value		2
#define RCC_DCKCFGR2_FMPI2C1SEL_mask			3

#define RCC_DCKCFGR2_LPTIM1SEL_APB			(RCC_DCKCFGR2_LPTIM1SEL_APB_value << RCC_DCKCFGR2_LPTIM1SEL_bit)
#define RCC_DCKCFGR2_LPTIM1SEL_HSI			(RCC_DCKCFGR2_LPTIM1SEL_HSI_value << RCC_DCKCFGR2_LPTIM1SEL_bit)
#define RCC_DCKCFGR2_LPTIM1SEL_LSI			(RCC_DCKCFGR2_LPTIM1SEL_LSI_value << RCC_DCKCFGR2_LPTIM1SEL_bit)
#define RCC_DCKCFGR2_LPTIM1SEL_LSE			(RCC_DCKCFGR2_LPTIM1SEL_LSE_value << RCC_DCKCFGR2_LPTIM1SEL_bit)

#define RCC_DCKCFGR2_FMPI2C1SEL_APB			(RCC_DCKCFGR2_FMPI2C1SEL_APB_value << RCC_DCKCFGR2_FMPI2C1SEL_bit)
#define RCC_DCKCFGR2_FMPI2C1SEL_SYSCLK		(RCC_DCKCFGR2_FMPI2C1SEL_SYSCLK_value << RCC_DCKCFGR2_FMPI2C1SEL_bit)
#define RCC_DCKCFGR2_FMPI2C1SEL_HSI			(RCC_DCKCFGR2_FMPI2C1SEL_HSI_value << RCC_DCKCFGR2_FMPI2C1SEL_bit)

#define RCC_DCKCFGR2_LPTIM1SEL_0_bb			BITBAND(&RCC->DCKCFGR2, RCC_DCKCFGR2_LPTIM1SEL_0_bit)
#define RCC_DCKCFGR2_LPTIM1SEL_1_bb			BITBAND(&RCC->DCKCFGR2, RCC_DCKCFGR2_LPTIM1SEL_1_bit)

#define RCC_DCKCFGR2_SPDIFRXSEL_bb			BITBAND(&RCC->DCKCFGR2, RCC_DCKCFGR2_SPDIFRXSEL_bit)
#define RCC_DCKCFGR2_SDIOSEL_bb				BITBAND(&RCC->DCKCFGR2, RCC_DCKCFGR2_SDIOSEL_bit)
#define RCC_DCKCFGR2_CK48MSEL_bb			BITBAND(&RCC->DCKCFGR2, RCC_DCKCFGR2_CK48MSEL_bit)
#define RCC_DCKCFGR2_CECSEL_bb				BITBAND(&RCC->DCKCFGR2, RCC_DCKCFGR2_CECSEL_bit)

#define RCC_DCKCFGR2_FMPI2C1SEL_0_bb		BITBAND(&RCC->DCKCFGR2, RCC_DCKCFGR2_FMPI2C1SEL_0_bit)
#define RCC_DCKCFGR2_FMPI2C1SEL_1_bb		BITBAND(&RCC->DCKCFGR2, RCC_DCKCFGR2_FMPI2C1SEL_1_bit)

#endif	/* SOURCE_CHIP_STM32_STM32F4_INCLUDE_DISTORTOS_CHIP_STM32F4_RCC_BITS_H_ */
